# Show Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FileDialog..::..Show Method
FileDialog Class See Also
---
Shows the dialog using the stored settings.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public ItemSelectionDialogResult Show()
```

Visual Basic
---
```text
Public Function Show As ItemSelectionDialogResult
```

Visual C++
---
```text
public:
ItemSelectionDialogResult Show()
```

# ### Return Value
A status indicating whether the user selected a file name or cancelled the dialog without making a selection.
# See Also
FileDialog Class
Autodesk.Revit.UI Namespace